Virviglaz/mylibraries/STM32F0xx/gpio.h
#ifndef GPIO_H
#define GPIO_H

#include <stm32f0xx.h>
#include <stdio.h>

#define PA0			GPIOA, GPIO_Pin_0
#define PA1			GPIOA, GPIO_Pin_1
#define PA2			GPIOA, GPIO_Pin_2
#define PA3			GPIOA, GPIO_Pin_3
#define PA4			GPIOA, GPIO_Pin_4
#define PA5			GPIOA, GPIO_Pin_5
#define PA6			GPIOA, GPIO_Pin_6
#define PA7			GPIOA, GPIO_Pin_7
#define PA8			GPIOA, GPIO_Pin_8
#define PA9			GPIOA, GPIO_Pin_9
#define PA10		GPIOA, GPIO_Pin_10
#define PA11		GPIOA, GPIO_Pin_11
#define PA12		GPIOA, GPIO_Pin_12
#define PA13		GPIOA, GPIO_Pin_13
#define PA14		GPIOA, GPIO_Pin_14
#define PA15		GPIOA, GPIO_Pin_15

#define PB0			GPIOB, GPIO_Pin_0
#define PB1			GPIOB, GPIO_Pin_1
#define PB2			GPIOB, GPIO_Pin_2
#define PB3			GPIOB, GPIO_Pin_3
#define PB4			GPIOB, GPIO_Pin_4
#define PB5			GPIOB, GPIO_Pin_5
#define PB6			GPIOB, GPIO_Pin_6
#define PB7			GPIOB, GPIO_Pin_7
#define PB8			GPIOB, GPIO_Pin_8
#define PB9			GPIOB, GPIO_Pin_9
#define PB10		GPIOB, GPIO_Pin_10
#define PB11		GPIOB, GPIO_Pin_11
#define PB12		GPIOB, GPIO_Pin_12
#define PB13		GPIOB, GPIO_Pin_13
#define PB14		GPIOB, GPIO_Pin_14
#define PB15		GPIOB, GPIO_Pin_15

#define PC0			GPIOC, GPIO_Pin_0
#define PC1			GPIOC, GPIO_Pin_1
#define PC2			GPIOC, GPIO_Pin_2
#define PC3			GPIOC, GPIO_Pin_3
#define PC4			GPIOC, GPIO_Pin_4
#define PC5			GPIOC, GPIO_Pin_5
#define PC6			GPIOC, GPIO_Pin_6
#define PC7			GPIOC, GPIO_Pin_7
#define PC8			GPIOC, GPIO_Pin_8
#define PC9			GPIOC, GPIO_Pin_9
#define PC10		GPIOC, GPIO_Pin_10
#define PC11		GPIOC, GPIO_Pin_11
#define PC12		GPIOC, GPIO_Pin_12
#define PC13		GPIOC, GPIO_Pin_13
#define PC14		GPIOC, GPIO_Pin_14
#define PC15		GPIOC, GPIO_Pin_15

#define PD0			GPIOD, GPIO_Pin_0
#define PD1			GPIOD, GPIO_Pin_1
#define PD2			GPIOD, GPIO_Pin_2
#define PD3			GPIOD, GPIO_Pin_3
#define PD4			GPIOD, GPIO_Pin_4
#define PD5			GPIOD, GPIO_Pin_5
#define PD6			GPIOD, GPIO_Pin_6
#define PD7			GPIOD, GPIO_Pin_7
#define PD8			GPIOD, GPIO_Pin_8
#define PD9			GPIOD, GPIO_Pin_9
#define PD10		GPIOD, GPIO_Pin_10
#define PD11		GPIOD, GPIO_Pin_11
#define PD12		GPIOD, GPIO_Pin_12
#define PD13		GPIOD, GPIO_Pin_13
#define PD14		GPIOD, GPIO_Pin_14
#define PD15		GPIOD, GPIO_Pin_15

#define PE0			GPIOE, GPIO_Pin_0
#define PE1			GPIOE, GPIO_Pin_1
#define PE2			GPIOE, GPIO_Pin_2
#define PE3			GPIOE, GPIO_Pin_3
#define PE4			GPIOE, GPIO_Pin_4
#define PE5			GPIOE, GPIO_Pin_5
#define PE6			GPIOE, GPIO_Pin_6
#define PE7			GPIOE, GPIO_Pin_7
#define PE8			GPIOE, GPIO_Pin_8
#define PE9			GPIOE, GPIO_Pin_9
#define PE10		GPIOE, GPIO_Pin_10
#define PE11		GPIOE, GPIO_Pin_11
#define PE12		GPIOE, GPIO_Pin_12
#define PE13		GPIOE, GPIO_Pin_13
#define PE14		GPIOE, GPIO_Pin_14
#define PE15		GPIOE, GPIO_Pin_15

#define PF0			GPIOF, GPIO_Pin_0
#define PF1			GPIOF, GPIO_Pin_1
#define PF2			GPIOF, GPIO_Pin_2
#define PF3			GPIOF, GPIO_Pin_3
#define PF4			GPIOF, GPIO_Pin_4
#define PF5			GPIOF, GPIO_Pin_5
#define PF6			GPIOF, GPIO_Pin_6
#define PF7			GPIOF, GPIO_Pin_7
#define PF8			GPIOF, GPIO_Pin_8
#define PF9			GPIOF, GPIO_Pin_9
#define PF10		GPIOF, GPIO_Pin_10
#define PF11		GPIOF, GPIO_Pin_11
#define PF12		GPIOF, GPIO_Pin_12
#define PF13		GPIOF, GPIO_Pin_13
#define PF14		GPIOF, GPIO_Pin_14
#define PF15		GPIOF, GPIO_Pin_15

typedef struct
{
	uint16_t (* Read)			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* High) 				(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Low)					(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* DigInput)			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* AnInput) 			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_PP_LS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_PP_MS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_PP_HS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_OD_LS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_OD_MS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_OD_HS)		(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Inv)					(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Input_PU)			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Input_AF_PU)	(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Input_AF)			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Input_PD)			(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_AF_PP_HS)	(GPIO_TypeDef * GPIOx, uint16_t PINx);
	void (* Out_AF_OD_HS)	(GPIO_TypeDef * GPIOx, uint16_t PINx);	
}IO_ClassTypeDef;

uint16_t PIN_SYG(GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_ON(GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OFF(GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN_AN (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_PP_LS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_PP_MS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_PP_HS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_OD_LS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_OD_MS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_OD_HS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_INV(GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN_PU (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN_AF_PU (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN_AF (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_IN_PD (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_AF_PP_HS (GPIO_TypeDef * GPIOx, uint16_t PINx);
void PIN_OUT_AF_OD_HS (GPIO_TypeDef * GPIOx, uint16_t PINx);

static const IO_ClassTypeDef IO = {PIN_SYG, PIN_ON, PIN_OFF, PIN_IN, PIN_IN_AN, PIN_OUT_PP_LS, PIN_OUT_PP_MS,
	PIN_OUT_PP_HS, PIN_OUT_OD_LS, PIN_OUT_OD_MS, PIN_OUT_OD_HS, PIN_INV, PIN_IN_PU, PIN_IN_AF_PU, PIN_IN_AF,
	PIN_IN_PD, PIN_OUT_AF_PP_HS, PIN_OUT_AF_OD_HS};
#endif
